"""------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：古典问题：有一对兔子，从出生后第3个月起每个月都生
      一对兔子，小兔子长到第三个月后每个月又生一对兔子，
      假如兔子都不死，问每个月的兔子总数为多少？

说明：rabbit()函数的功能是根据输入的月数返回兔子对数

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。

      请用for语句编写
------------------------------------------------------"""


def rabbit(num):
    # **********Program**********
    # 提示：第一步当num为1和2的时候，返回值为1
    # 提示：第二步其它情况下，前面相邻两项之和，构成了后一项（tz=rabbit(num-2)+rabbit(num-1)，返回值为tz）
    if num == 1 or num == 2:
        return 1
    else:
        # 其它情况下，前面相邻两项之和，构成了后一项
        a, b = 1, 1
        for _ in range(num - 2):
            a, b = b, a + b
        return b

    # **********  End  **********


def main():
    n = int(input("【查看第几个月的兔子对数：】"))
    rabbit_sum = rabbit(n)
    print("【第%d个月的兔子对数为】%d" % (n, rabbit_sum))


if __name__ == '__main__':
    main()
