from math import log

dataSet = [["ÇàÂÌ", "òéËõ", "×ÇÏì", "ÇåÎú", "°¼Ïİ", "Ó²»¬", "ÊÇ"],
           ["ÎÚºÚ", "òéËõ", "³ÁÃÆ", "ÇåÎú", "°¼Ïİ", "Ó²»¬", "ÊÇ"],
           ["ÎÚºÚ", "òéËõ", "×ÇÏì", "ÇåÎú", "°¼Ïİ", "Ó²»¬", "ÊÇ"],
           ["ÇàÂÌ", "òéËõ", "³ÁÃÆ", "ÇåÎú", "°¼Ïİ", "Ó²»¬", "ÊÇ"],
           ["Ç³°×", "òéËõ", "×ÇÏì", "ÇåÎú", "°¼Ïİ", "Ó²»¬", "ÊÇ"],
           ["ÇàÂÌ", "ÉÔòé", "×ÇÏì", "ÇåÎú", "ÉÔ°¼", "ÈíÕ³", "ÊÇ"],
           ["ÎÚºÚ", "ÉÔòé", "×ÇÏì", "ÉÔºı", "ÉÔ°¼", "ÈíÕ³", "ÊÇ"],
           ["ÎÚºÚ", "ÉÔòé", "×ÇÏì", "ÇåÎú", "ÉÔ°¼", "Ó²»¬", "ÊÇ"],
           ["ÎÚºÚ", "ÉÔòé", "³ÁÃÆ", "ÉÔºı", "ÉÔ°¼", "Ó²»¬", "·ñ"],
           ["ÇàÂÌ", "Ó²Í¦", "Çå´à", "ÇåÎú", "Æ½Ì¹", "ÈíÕ³", "·ñ"],
           ["Ç³°×", "Ó²Í¦", "Çå´à", "Ä£ºı", "Æ½Ì¹", "Ó²»¬", "·ñ"],
           ["Ç³°×", "òéËõ", "×ÇÏì", "Ä£ºı", "Æ½Ì¹", "ÈíÕ³", "·ñ"],
           ["ÇàÂÌ", "ÉÔòé", "×ÇÏì", "ÉÔºı", "°¼Ïİ", "Ó²»¬", "·ñ"],
           ["Ç³°×", "ÉÔòé", "³ÁÃÆ", "ÉÔºı", "°¼Ïİ", "Ó²»¬", "·ñ"],
           ["ÎÚºÚ", "ÉÔòé", "×ÇÏì", "ÇåÎú", "ÉÔ°¼", "ÈíÕ³", "·ñ"],
           ["Ç³°×", "òéËõ", "×ÇÏì", "Ä£ºı", "Æ½Ì¹", "Ó²»¬", "·ñ"],
           ["ÇàÂÌ", "òéËõ", "³ÁÃÆ", "ÉÔºı", "ÉÔ°¼", "Ó²»¬", "·ñ"], ]


# ¼ÆËãĞÅÏ¢ìØ
def calcShannonEnt(dataSet):  # dataSetÎªÊı¾İ¼¯
    # ********* Begin *******#

    label_counts = {}
    for sample in dataSet:
        label = sample[-1]
        if label not in label_counts:
            label_counts[label] = 0
        label_counts[label] += 1

    entropy = 0.0
    total_samples = len(dataSet)
    for label in label_counts:
        probability = float(label_counts[label]) / total_samples
        entropy -= probability * log(probability, 2)

    return entropy


# ********* End *********#

print(calcShannonEnt(dataSet))

